Context diagram naar Mermaid syntax ipv PlantUml zodat het gerenderd wordt op GitHub
